### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
purchase_data
# 780 rows x 7 columns

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [3]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [4]:
total_players = purchase_data["SN"].nunique()
total_players

#576 unique players

576

In [165]:
total_players_df = pd.DataFrame([total_players], columns = ["Total Players"])
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
# Number of Unique Item Names
unique_items = purchase_data["Item Name"].nunique()
unique_items

179

In [101]:
# Average Purchase Price

average_price = purchase_data["Price"].mean()
average_price

3.050987179487176

In [7]:
# Total Number of Purchases

total_purchases = purchase_data["Purchase ID"].nunique()
total_purchases

780

In [8]:
# Total Revenue

total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [166]:
summary_df = pd.DataFrame({"Number of Unique Items": [unique_items],
                          "Average Price": [average_price],
                          "Number of Purchases": [total_purchases],
                          "Total Revenue": [total_revenue]})
summary_df.style.format({"Average Price": "${:.2f}", "Total Revenue": "${:.2f}"})

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
# duplicate play names removed 
gender_sn = purchase_data.loc[:,["Gender", "SN"]]
gender_sn = gender_sn.drop_duplicates()
gender_sn

     Gender             SN
0      Male        Lisim78
1      Male    Lisovynya38
2      Male     Ithergue48
3      Male  Chamassasya86
4      Male      Iskosia90
..      ...            ...
773    Male         Hala31
774    Male     Jiskjask80
775  Female     Aethedru70
777    Male     Yathecal72
778    Male        Sisur91

[576 rows x 2 columns]

In [11]:
#This now takes into consideration the removal of duplicate SNs, and has gender broken out based on unqiue player
gender_total = gender_sn["Gender"].value_counts()
gender_total

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [12]:
# gender count
gender_info = pd.DataFrame({"Total Count": gender_total})
gender_info

                       Total Count
Male                           484
Female                          81
Other / Non-Disclosed           11

In [175]:
# gender percentage
gender_percentage = gender_total / total_players * 100
gender_percentage

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [203]:
gender_breakdown = pd.DataFrame({"Total Count": gender_total,
                           "Percentage of Players": gender_percentage})

                    
gender_breakdown

                       Total Count  Percentage of Players
Male                           484              84.027778
Female                          81              14.062500
Other / Non-Disclosed           11               1.909722


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [15]:
# Calculate purchase count by gender based on Gender & Price columns 
purchase_analysis_gender_total = purchase_data.groupby(["Gender"]).count()["Price"]
purchase_analysis_gender_total

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [16]:
# Calculate average(mean) purchase price 
purchase_analysis_gender_average = purchase_data.groupby(["Gender"]).mean()["Price"]
purchase_analysis_gender_average

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [17]:
# Calculate total (sum) purchases dollar amounts by gender 
purchase_analysis_gender_total = purchase_data.groupby(["Gender"]).count()["Price"]
purchase_analysis_gender_total

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [18]:
# Calculate total (sum) purchases dollar amounts by gender 
purchase_analysis_gender_total_value = purchase_data.groupby(["Gender"]).sum()["Price"]
purchase_analysis_gender_total_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [19]:
# Calculate average(mean) purchase total per person by gender
average_perchase_per_person_gender = purchase_analysis_gender_total/gender_total
average_perchase_per_person_gender

Female                   1.395062
Male                     1.347107
Other / Non-Disclosed    1.363636
dtype: float64

In [20]:
purchase_analysis_gender_average_amount = purchase_analysis_gender_total_value/gender_total
purchase_analysis_gender_average_amount

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [162]:
# Create a summary data frame to hold the results

summary_df = pd.DataFrame({"Purchase Count": purchase_analysis_gender_total,
                           "Average Purchase Price": purchase_analysis_gender_average,
                          "Total Purchase Value": purchase_analysis_gender_total_value, 
                          "Avg Total Purchase Per Person": purchase_analysis_gender_average_amount})
summary_df.style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value": "${:.2f}", "Avg Total Purchase Per Person": "${:.2f}"})

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [22]:
# Establish bins for ages
# Need to break down to get the ages players into a dataframe

player_age = purchase_data.loc[:,["Age", "SN"]]
player_age

     Age             SN
0     20        Lisim78
1     40    Lisovynya38
2     24     Ithergue48
3     24  Chamassasya86
4     23      Iskosia90
..   ...            ...
775   21     Aethedru70
776   21         Iral74
777   20     Yathecal72
778    7        Sisur91
779   24      Ennrian78

[780 rows x 2 columns]

In [23]:
# Establish bins for ages
# Need to remove SN (play IDs), so there's only a dataframe with the ages for the unique players

player_age = player_age.drop_duplicates()
player_age

     Age             SN
0     20        Lisim78
1     40    Lisovynya38
2     24     Ithergue48
3     24  Chamassasya86
4     23      Iskosia90
..   ...            ...
773   21         Hala31
774   11     Jiskjask80
775   21     Aethedru70
777   20     Yathecal72
778    7        Sisur91

[576 rows x 2 columns]

In [24]:
# Establish bins for ages
# Players per age

# player_age_current = player_age["Age"].value_counts()
# pd.DataFrame(player_age_current).plot(kind="scatter",x=player_age_current.index, y=player_age_current.values)

In [25]:

# Categorize the existing players using the age bins.
# Lables for ages are < 10, 10-14, 15-19, 20-24, 25-29, 30-34, 35-39, 40+

age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]

labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [26]:
# Breakdown of players by age bins

age_demographic = pd.cut(player_age["Age"], age_bins, labels=labels).value_counts()
age_demographic

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age, dtype: int64

In [27]:
# Calculate the numbers and percentages by age group
age_group_percent = age_demographic/total_players * 100
age_group_percent

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age, dtype: float64

In [209]:
# Create a summary data frame to hold the results

age_group_percentage = pd.DataFrame({"Total Count": age_demographic, 
                                    "Percentage of Players": age_group_percent})

age_group_percentage.sort_index()

       Total Count  Percentage of Players
<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
40+             12               2.083333

In [29]:
# Calculate total (sum) purchases dollar amounts by gender 
purchase_analysis_gender_total = purchase_data.groupby(["Gender"]).count()["Price"]
purchase_analysis_gender_total

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [30]:
normalized_total = purchase_analysis_gender_total_value/gender_total
normalized_total

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [31]:
gender_total

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [157]:
# Purchasing Analysis (Age)
# Bin the purchase_data data frame by age
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], age_bins, labels=labels)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [33]:
# Purchase count by Age Ranges 
age_total_analysis = purchase_data.groupby(["Age Ranges"]).count()["Price"].rename("Purchase Count")
age_total_analysis

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase Count, dtype: int64

In [34]:
# Average Purchase Price by Age Ranges
age_average_analysis = purchase_data.groupby(["Age Ranges"]).mean()["Price"].rename("Average Purchase Price")
age_average_analysis

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Average Purchase Price, dtype: float64

In [35]:
# Total Purchase Value by Age Ranges
age_total_value = purchase_data.groupby(["Age Ranges"]).sum()["Price"].rename("Total Purchase Value")
age_total_value

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Total Purchase Value, dtype: float64

In [36]:
# Average Total Purchase per Person by Age Ranges
per_person_purchase_avg = age_total_value/age_demographic
per_person_purchase_avg

<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [37]:
normalized_total

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [218]:
# Purchasing Analysis (Age) Summary Table
purchase_analysis_age = pd.DataFrame({"Purchase Count": age_total_analysis, 
                                     "Average Purchase Price": age_average_analysis, 
                                     "Total Purchase Value": age_total_value, 
                                     "Avg Total Purchase per Person": per_person_purchase_avg})


purchase_analysis_age.style.format({"Total Purchase Value": "${:.2f}", "Avg Total Purchase per Person": "${:.2f}"})

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [39]:
# Top Spenders all players 
top_spenders = purchase_data.loc[:,["SN"]]
top_spenders

                SN
0          Lisim78
1      Lisovynya38
2       Ithergue48
3    Chamassasya86
4        Iskosia90
..             ...
775     Aethedru70
776         Iral74
777     Yathecal72
778        Sisur91
779      Ennrian78

[780 rows x 1 columns]

In [40]:
# Top Spenders players with duplicates removed
top_spenders = top_spenders.drop_duplicates()
top_spenders

                SN
0          Lisim78
1      Lisovynya38
2       Ithergue48
3    Chamassasya86
4        Iskosia90
..             ...
773         Hala31
774     Jiskjask80
775     Aethedru70
777     Yathecal72
778        Sisur91

[576 rows x 1 columns]

In [41]:
# Purchase Count by SN

sn_purchase_count = purchase_data.groupby(["SN"]).count()["Price"].rename("Purchase Count")
print(sn_purchase_count)

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase Count, Length: 576, dtype: int64

In [42]:
# Average Purchase Price by SN
# Is there a way to have these in descending order?

sn_purchase_average = purchase_data.groupby(["SN"]).mean()["Price"].rename("Average Purchase Price")
print(sn_purchase_average)

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Average Purchase Price, Length: 576, dtype: float64

In [43]:
# Total Purchase Price by SN
sn_purchase_total = purchase_data.groupby(["SN"]).sum()["Price"].rename("Total Purchase Value")
print(sn_purchase_total)

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Total Purchase Value, Length: 576, dtype: float64

In [103]:
# Top Spenders summary table 
top_spender_summary = pd.DataFrame({"Purchase Count": sn_purchase_count, 
                                   "Average Purchase Price": sn_purchase_average,
                                   "Total Purchase Value": sn_purchase_total})
top_spender_summary

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [225]:
top_spender_summary_analysis = top_spender_summary.sort_values("Total Purchase Value", ascending=False).head(5)
top_spender_summary_analysis.style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [46]:
# Retrieve Item ID
item_id = purchase_data.loc[:,["Item ID"]]
item_id

     Item ID
0        108
1        143
2         92
3        100
4        131
..       ...
775       60
776      164
777       67
778       92
779       50

[780 rows x 1 columns]

In [47]:
# Retrieve Item ID drop duplicates
item_id = item_id.drop_duplicates()
item_id

     Item ID
0        108
1        143
2         92
3        100
4        131
..       ...
664       47
673      130
700       90
717      177
727      104

[179 rows x 1 columns]

In [140]:
# Retrieve Item Name
item_name = purchase_data.loc[:,["Item ID", "Item Name", "Price"]]
item_name

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [141]:
# Retrieve Item Name drop duplicate
item_name = item_name.drop_duplicates()
item_name

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
673      130                                      Alpha   2.07
700       90                                   Betrayer   2.94
717      177   Winterthorn, Defender of Shifting Worlds   2.08
727      104                         Gladiator's Glaive   1.93
751       30                                Stormcaller   3.36

[183 rows x 3 columns]

In [143]:
# Retrieve Item Price
item_price = purchase_data.loc[:,["Price"]]
item_price

     Price
0     3.53
1     1.56
2     4.88
3     3.27
4     1.44
..     ...
775   3.54
776   1.63
777   3.46
778   4.19
779   4.60

[780 rows x 1 columns]

In [51]:
# Group by Item ID
item_id = purchase_data.groupby("Item ID").sum().reset_index()
item_id

     Item ID  Purchase ID  Age  Price
0          0         1149   74   5.12
1          1         1523   89  11.77
2          2         2006  143  14.88
3          3         2087  155  14.94
4          4         1885  124   8.50
..       ...          ...  ...    ...
174      178         4960  287  50.76
175      179         1948  126  26.88
176      181         1278  109   8.30
177      182         1327   67  12.09
178      183         1488   66   3.27

[179 rows x 4 columns]

In [52]:
# Group by Item Name
item_name = purchase_data.groupby("Item Name").sum().reset_index()
item_name

                           Item Name  Purchase ID  Age  Item ID  Price
0                      Abyssal Shard         1140  111      810  13.35
1     Aetherius, Boon of the Blessed         2037  126      685  16.95
2                             Agatha         2305  124      720  18.48
3                              Alpha         2137   65      390   6.21
4                Alpha, Oath of Zeal         1602   68      237  12.15
..                               ...          ...  ...      ...    ...
174                             Wolf         3142  145      480  28.32
175  Wolf, Promise of the Moonwalker         1948  126     1074  26.88
176                     Worldbreaker         2446   89      448  10.40
177                 Yearning Crusher         1216   63      222  12.54
178               Yearning Mageblade         2033  109      570  19.10

[179 rows x 5 columns]

In [53]:
# Perform calculations to obtain purchase count
item_id_counts = purchase_data.groupby("Item Name").count().reset_index()
item_id_counts

,Item Name,Purchase ID,SN,Age,Gender,Item ID,Price,Age Ranges
0,Abyssal Shard,5,5,5,5,5,5,5
1,"Aetherius, Boon of the Blessed",5,5,5,5,5,5,5
2,Agatha,6,6,6,6,6,6,6
3,Alpha,3,3,3,3,3,3,3
4,"Alpha, Oath of Zeal",3,3,3,3,3,3,3
...,...,...,...,...,...,...,...,...
174,Wolf,8,8,8,8,8,8,8
175,"Wolf, Promise of the Moonwalker",6,6,6,6,6,6,6
176,Worldbreaker,4,4,4,4,4,4,4
177,Yearning Crusher,3,3,3,3,3,3,3
178,Yearning Mageblade,5,5,5,5,5,5,5

In [69]:
#working on updating cols

item_id_sum = pd.merge(item_id, item_name, on="Price")
item_id_sum

,Item ID_x,Purchase ID_x,Age_x,Price,Item Name,Purchase ID_y,Age_y,Item ID_y
0,0,1149,74,5.12,Splinter,1149,74,0
1,1,1523,89,11.77,Crucifer,1523,89,4
2,2,2006,143,14.88,Verdict,2006,143,12
3,3,2087,155,14.94,Phantomlight,2087,155,18
4,4,1885,124,8.50,Bloodlord's Fetish,1885,124,20
...,...,...,...,...,...,...,...,...
196,177,1440,51,4.16,"Winterthorn, Defender of Shifting Worlds",1440,51,354
197,178,4960,287,50.76,"Oathbreaker, Last Hope of the Breaking Storm",4960,287,2136
198,179,1948,126,26.88,"Wolf, Promise of the Moonwalker",1948,126,1074
199,181,1278,109,8.30,Reaper's Toll,1278,109,905
200,183,1488,66,3.27,Dragon's Greatsword,1488,66,549

In [73]:
#working on updating cols
item_id_count = pd.merge(item_id_counts, item_id_sum, on="Item Name")
item_id_sum

,Item ID_x,Purchase ID_x,Age_x,Price,Item Name,Purchase ID_y,Age_y,Item ID_y
0,0,1149,74,5.12,Splinter,1149,74,0
1,1,1523,89,11.77,Crucifer,1523,89,4
2,2,2006,143,14.88,Verdict,2006,143,12
3,3,2087,155,14.94,Phantomlight,2087,155,18
4,4,1885,124,8.50,Bloodlord's Fetish,1885,124,20
...,...,...,...,...,...,...,...,...
196,177,1440,51,4.16,"Winterthorn, Defender of Shifting Worlds",1440,51,354
197,178,4960,287,50.76,"Oathbreaker, Last Hope of the Breaking Storm",4960,287,2136
198,179,1948,126,26.88,"Wolf, Promise of the Moonwalker",1948,126,1074
199,181,1278,109,8.30,Reaper's Toll,1278,109,905
200,183,1488,66,3.27,Dragon's Greatsword,1488,66,549

In [78]:
#working on updating cols
item_id_count["Gender"] = (item_id_count["Price_y"]/item_id_count["Item ID"]).round(2)
item_id_count

,Item Name,Purchase ID,SN,Age,Gender,Item ID,Price_x,Age Ranges,Item ID_x,Purchase ID_x,Age_x,Price_y,Purchase ID_y,Age_y,Item ID_y
0,Abyssal Shard,5,5,5,2.67,5,5,5,162,1140,111,13.35,1140,111,810
1,"Aetherius, Boon of the Blessed",5,5,5,3.39,5,5,5,80,1961,110,16.95,2037,126,685
2,"Aetherius, Boon of the Blessed",5,5,5,3.39,5,5,5,137,2037,126,16.95,2037,126,685
3,Agatha,6,6,6,3.08,6,6,6,120,2305,124,18.48,2305,124,720
4,Alpha,3,3,3,2.07,3,3,3,130,2137,65,6.21,2137,65,390
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,Wolf,8,8,8,3.54,8,8,8,60,3142,145,28.32,3142,145,480
197,"Wolf, Promise of the Moonwalker",6,6,6,4.48,6,6,6,179,1948,126,26.88,1948,126,1074
198,Worldbreaker,4,4,4,2.60,4,4,4,112,2446,89,10.40,2446,89,448
199,Yearning Crusher,3,3,3,4.18,3,3,3,74,1216,63,12.54,1216,63,222
200,Yearning Mageblade,5,5,5,3.82,5,5,5,114,2033,109,19.10,2033,109,570

In [80]:
#working on updating cols
col_update_item_id_count = item_id_count.rename(columns={"Age": "Purchase Count", "Gender": "Item Price", "Item ID": "null", "Price_y": "Total Purchase Value", "Item_ID_y": "Item ID"})
col_update_item_id_count

,Item Name,Purchase ID,SN,Purchase Count,Item Price,null,Price_x,Age Ranges,Item ID_x,Purchase ID_x,Age_x,Total Purchase Value,Purchase ID_y,Age_y,Item ID_y
0,Abyssal Shard,5,5,5,2.67,5,5,5,162,1140,111,13.35,1140,111,810
1,"Aetherius, Boon of the Blessed",5,5,5,3.39,5,5,5,80,1961,110,16.95,2037,126,685
2,"Aetherius, Boon of the Blessed",5,5,5,3.39,5,5,5,137,2037,126,16.95,2037,126,685
3,Agatha,6,6,6,3.08,6,6,6,120,2305,124,18.48,2305,124,720
4,Alpha,3,3,3,2.07,3,3,3,130,2137,65,6.21,2137,65,390
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
196,Wolf,8,8,8,3.54,8,8,8,60,3142,145,28.32,3142,145,480
197,"Wolf, Promise of the Moonwalker",6,6,6,4.48,6,6,6,179,1948,126,26.88,1948,126,1074
198,Worldbreaker,4,4,4,2.60,4,4,4,112,2446,89,10.40,2446,89,448
199,Yearning Crusher,3,3,3,4.18,3,3,3,74,1216,63,12.54,1216,63,222
200,Yearning Mageblade,5,5,5,3.82,5,5,5,114,2033,109,19.10,2033,109,570

In [144]:
#working on updating cols
updated_col_names = col_update_item_id_count[["Item ID_x", "Item Name", "Purchase Count", "Total Purchase Value"]]
updated_col_names

,Item ID_x,Item Name,Purchase Count,Total Purchase Value
0,162,Abyssal Shard,5,13.35
1,80,"Aetherius, Boon of the Blessed",5,16.95
2,137,"Aetherius, Boon of the Blessed",5,16.95
3,120,Agatha,6,18.48
4,130,Alpha,3,6.21
...,...,...,...,...
196,60,Wolf,8,28.32
197,179,"Wolf, Promise of the Moonwalker",6,26.88
198,112,Worldbreaker,4,10.40
199,74,Yearning Crusher,3,12.54
200,114,Yearning Mageblade,5,19.10

In [232]:
# most popular items
# total_popular_item = updated_col_names.sort_values("Purchase Count",ascending=False).head(5)
# total_popular_item.style.format({"Total Purchase Value": "${:.2f}"})

In [231]:
update_pop = total_popular_item[["Item Name", "Purchase Count","Total Purchase Value"]]
update_pop.style.format({"Total Purchase Value": "${:.2f}"})

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [ ]:
# Biggest cumulative purchase count
cumulative_purchase_count

In [233]:
# most profitable items
# sorting by purchase value
profitable_items = updated_col_names.sort_values("Total Purchase Value",ascending=False).head(5)
profitable_items.style.format({"Item Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})